<details><summary>✅ Cloud Infrastructure Formatting</summary>

```diff

```
</details>

<details><summary>✅ Cloud Infrastructure Plan</summary>

```HCL
google_project_service.apis["bigquerystorage.googleapis.com"]: Refreshing state... [id=arikkfir/bigquerystorage.googleapis.com]
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=arikkfir/bigquery.googleapis.com]
google_project_service.apis["cloudbilling.googleapis.com"]: Refreshing state... [id=arikkfir/cloudbilling.googleapis.com]
google_project_service.apis["dns.googleapis.com"]: Refreshing state... [id=arikkfir/dns.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=arikkfir/iam.googleapis.com]
google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=arikkfir/secretmanager.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=arikkfir/pubsub.googleapis.com]
google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=arikkfir/monitoring.googleapis.com]
google_project_service.apis["iamcredentials.googleapis.com"]: Refreshing state... [id=arikkfir/iamcredentials.googleapis.com]
google_project_service.apis["serviceusage.googleapis.com"]: Refreshing state... [id=arikkfir/serviceusage.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=arikkfir/artifactregistry.googleapis.com]
google_project_service.apis["storage-component.googleapis.com"]: Refreshing state... [id=arikkfir/storage-component.googleapis.com]
google_project_service.apis["container.googleapis.com"]: Refreshing state... [id=arikkfir/container.googleapis.com]
google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=arikkfir/logging.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=arikkfir/compute.googleapis.com]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=arikkfir/cloudresourcemanager.googleapis.com]
google_project_service.apis["servicemanagement.googleapis.com"]: Refreshing state... [id=arikkfir/servicemanagement.googleapis.com]
google_project_service.apis["oslogin.googleapis.com"]: Refreshing state... [id=arikkfir/oslogin.googleapis.com]
google_project_service.apis["containerfilesystem.googleapis.com"]: Refreshing state... [id=arikkfir/containerfilesystem.googleapis.com]
google_project_service.apis["storage-api.googleapis.com"]: Refreshing state... [id=arikkfir/storage-api.googleapis.com]
google_project_service.apis["containerregistry.googleapis.com"]: Refreshing state... [id=arikkfir/containerregistry.googleapis.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.gke will be created
  + resource "google_compute_network" "gke" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "GKE VPC"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "gke"
      + project                         = "arikkfir"
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.gke-subnet will be created
  + resource "google_compute_subnetwork" "gke-subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.100.0.0/16"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "gke-subnet-europe-west3"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "arikkfir"
      + purpose                    = (known after apply)
      + region                     = "europe-west3"
      + secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.110.0.0/17"
              + range_name    = "gke-pods"
            },
          + {
              + ip_cidr_range = "10.110.128.0/17"
              + range_name    = "gke-services"
            },
        ]
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + description                 = "Primary cluster."
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west3-a"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "primary"
      + network                     = (known after apply)
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "arikkfir"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled           = (known after apply)
              + load_balancer_type = (known after apply)
            }

          + config_connector_config {
              + enabled = true
            }

          + dns_cache_config {
              + enabled = (known after apply)
            }

          + gce_persistent_disk_csi_driver_config {
              + enabled = (known after apply)
            }

          + gcp_filestore_csi_driver_config {
              + enabled = (known after apply)
            }

          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = true
            }

          + istio_config {
              + auth     = (known after apply)
              + disabled = (known after apply)
            }

          + kalm_config {
              + enabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + authenticator_groups_config {
          + security_group = "gke-security-groups@kfirfamily.com"
        }

      + cluster_autoscaling {
          + autoscaling_profile = "OPTIMIZE_UTILIZATION"
          + enabled             = false

          + auto_provisioning_defaults {
              + image_type       = (known after apply)
              + min_cpu_platform = (known after apply)
              + oauth_scopes     = (known after apply)
              + service_account  = (known after apply)
            }
        }

      + cluster_telemetry {
          + type = (known after apply)
        }

      + confidential_nodes {
          + enabled = (known after apply)
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + default_snat_status {
          + disabled = (known after apply)
        }

      + identity_service_config {
          + enabled = (known after apply)
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "gke-pods"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "gke-services"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + boot_disk_kms_key = (known after apply)
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + node_group        = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + spot              = (known after apply)
          + tags              = (known after apply)
          + taint             = (known after apply)

          + ephemeral_storage_config {
              + local_ssd_count = (known after apply)
            }

          + gcfs_config {
              + enabled = (known after apply)
            }

          + gvnic {
              + enabled = (known after apply)
            }

          + kubelet_config {
              + cpu_cfs_quota        = (known after apply)
              + cpu_cfs_quota_period = (known after apply)
              + cpu_manager_policy   = (known after apply)
            }

          + linux_node_config {
              + sysctls = (known after apply)
            }

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = (known after apply)
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + network_config {
              + create_pod_range    = (known after apply)
              + pod_ipv4_cidr_block = (known after apply)
              + pod_range           = (known after apply)
            }

          + node_config {
              + boot_disk_kms_key = (known after apply)
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + node_group        = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + spot              = (known after apply)
              + tags              = (known after apply)
              + taint             = (known after apply)

              + ephemeral_storage_config {
                  + local_ssd_count = (known after apply)
                }

              + gcfs_config {
                  + enabled = (known after apply)
                }

              + gvnic {
                  + enabled = (known after apply)
                }

              + kubelet_config {
                  + cpu_cfs_quota        = (known after apply)
                  + cpu_cfs_quota_period = (known after apply)
                  + cpu_manager_policy   = (known after apply)
                }

              + linux_node_config {
                  + sysctls = (known after apply)
                }

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + workload_metadata_config {
                  + mode = (known after apply)
                }
            }

          + placement_policy {
              + type = (known after apply)
            }

          + upgrade_settings {
              + max_surge       = (known after apply)
              + max_unavailable = (known after apply)
            }
        }

      + notification_config {
          + pubsub {
              + enabled = (known after apply)
              + topic   = (known after apply)
            }
        }

      + release_channel {
          + channel = "RAPID"
        }

      + vertical_pod_autoscaling {
          + enabled = (known after apply)
        }

      + workload_identity_config {
          + workload_pool = "arikkfir.svc.id.goog"
        }
    }

  # google_container_node_pool.core-n2-custom-4-7168-pre will be created
  + resource "google_container_node_pool" "core-n2-custom-4-7168-pre" {
      + cluster                     = "primary"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "core-n2-custom-4-7168-pre"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "arikkfir"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config {
          + create_pod_range    = (known after apply)
          + pod_ipv4_cidr_block = (known after apply)
          + pod_range           = (known after apply)
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "n2-custom-4-7168"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 0
        }
    }

  # google_container_node_pool.work-n2-custom-4-5120-pre will be created
  + resource "google_container_node_pool" "work-n2-custom-4-5120-pre" {
      + cluster                     = "primary"
      + id                          = (known after apply)
      + initial_node_count          = 0
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west3-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "work-n2-custom-4-5120-pre"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "arikkfir"
      + version                     = (known after apply)

      + autoscaling {
          + max_node_count = 3
          + min_node_count = 0
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 100
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "kfirs.com/workload-nodes" = "true"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n2-custom-4-5120"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + taint             = [
              + {
                  + effect = "NO_EXECUTE"
                  + key    = "kfirs.com/workload-nodes"
                  + value  = "true"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 0
        }
    }

  # google_project_iam_member.gke-node["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "gke-node" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "arikkfir"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.gke-node["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "gke-node" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "arikkfir"
      + role    = "roles/monitoring.metricWriter"
    }

  # google_service_account.config-connector will be created
  + resource "google_service_account" "config-connector" {
      + account_id   = "config-connector"
      + disabled     = false
      + display_name = "GKE Config Connector"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "arikkfir"
      + unique_id    = (known after apply)
    }

  # google_service_account.gha-arikkfir-deployment will be created
  + resource "google_service_account" "gha-arikkfir-deployment" {
      + account_id   = "gha-arikkfir-deployment"
      + disabled     = false
      + display_name = "GitHub Actions: arikkfir/deployment"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "arikkfir"
      + unique_id    = (known after apply)
    }

  # google_service_account.gha-arikkfir-kude will be created
  + resource "google_service_account" "gha-arikkfir-kude" {
      + account_id   = "gha-arikkfir-kude"
      + disabled     = false
      + display_name = "GitHub Actions: arikkfir/kude"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "arikkfir"
      + unique_id    = (known after apply)
    }

  # google_service_account.gke-node will be created
  + resource "google_service_account" "gke-node" {
      + account_id   = "gke-node"
      + disabled     = false
      + display_name = "GKE nodes service account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "arikkfir"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.config-connector_workload_identity will be created
  + resource "google_service_account_iam_member" "config-connector_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:arikkfir.svc.id.goog[cnrm-system/cnrm-controller-manager]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_service_account_iam_member.default-compute-gha-arikkfir-infrastructure-iam-serviceAccountUser will be created
  + resource "google_service_account_iam_member" "default-compute-gha-arikkfir-infrastructure-iam-serviceAccountUser" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/arikkfir/serviceAccounts/8909046976-compute@developer.gserviceaccount.com"
    }

  # google_service_account_iam_member.gke-node_gha-arikkfir-infrastructure_iam_serviceAccountUser will be created
  + resource "google_service_account_iam_member" "gke-node_gha-arikkfir-infrastructure_iam_serviceAccountUser" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:gha-arikkfir-infrastructure@arikkfir.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.arikkfir-artifacts will be created
  + resource "google_storage_bucket" "arikkfir-artifacts" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST3"
      + name                        = "arikkfir-artifacts"
      + project                     = "arikkfir"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.arikkfir-artifacts-gha-arikkfir-kude["roles/storage.objectCreator"] will be created
  + resource "google_storage_bucket_iam_member" "arikkfir-artifacts-gha-arikkfir-kude" {
      + bucket = "arikkfir-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # google_storage_bucket_iam_member.arikkfir-artifacts-gha-arikkfir-kude["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_member" "arikkfir-artifacts-gha-arikkfir-kude" {
      + bucket = "arikkfir-artifacts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```
</details>